<?php
// +----------------------------------------------------------------------
// | Yzncms [ 御宅男工作室 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://yzncms.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 御宅男 <530765310@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 会员模型
// +----------------------------------------------------------------------
namespace app\member\model;

use \think\Model;

/**
 * 模型
 */
class Member extends Model
{
    protected  $connection = [
        'type'        => 'mysql',
        'dsn'         => '',
        'hostname'    => '127.0.0.1',
        'database'    => 'moleweb',
        'username'    => 'root',
        'password'    => '123456',
        'hostport'    => '3306',
        'params'      => [],
        'charset'     => 'utf8',
        'prefix'      => 'xc_',
        'debug'       => false,
        'deploy'      => 0,
        'rw_separate' => false,
        'master_num'  => 1,
        'slave_no'    => '',
    ];
}
