<?php
// +----------------------------------------------------------------------
// | Yzncms [ 御宅男工作室 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://yzncms.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 御宅男 <530765310@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 充值验证
// +----------------------------------------------------------------------
namespace app\pay\validate;

use think\Validate;

class Account extends Validate
{
    //定义验证规则
    protected $rule = [
        'pay_type|充值类型' => 'require',
        'username|用户名' => 'require',
        'pay_unit|充值额度' => 'require',
        'unit|修改数量' => 'require',
    ];
}
